neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32F2.c

#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <math.h>
#include <time.h>

#include "soc.h"

#include "DMA/DMA.h"

#include "NeonRTOS.h"

#ifdef STM32F2

#include "DMA_STM32_Index.h"

#include "DMA_STM32.h"

//#include "CAN/Device/STM32/CAN_STM32.h"
#include "I2C/Device/STM32/I2C_Master_STM32.h"
#include "SPI/Device/STM32/SPI_Master_STM32.h"
#include "UART/Device/STM32/UART_STM32.h"

#define DMA_IRQ_NVIC_PRIORITY 5
#define DMA_IRQ_NVIC_SUB_PRIORITY 0

#define DMA_WAIT_ALLOCATED_TIMEOUT  1000
#define DMA_WAIT_TRANSFER_TIMEOUT   1000

#define DMA_STREAM_LOCK(stream_index) if (NeonRTOS_LockObjLock(&DMA_Stream_Mutex[(stream_index)], DMA_WAIT_ALLOCATED_TIMEOUT) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }
#define DMA_STREAM_UNLOCK(stream_index) if (NeonRTOS_LockObjUnlock(&DMA_Stream_Mutex[(stream_index)]) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }

static const hwDMA_Stream_Index UART_DMA_Channel_Map[hwUART_Index_MAX][hwDMA_Peripheral_Direction_MAX] = {
#if defined (UART1_BASE) || defined(USART1_BASE)
        {hwDMA_Stream_Index_0, hwDMA_Stream_Index_1},
#endif
#if defined (UART2_BASE) || defined(USART2_BASE)
        {hwDMA_Stream_Index_2, hwDMA_Stream_Index_3},
#endif
#if defined (UART3_BASE) || defined(USART3_BASE)
        {hwDMA_Stream_Index_4, hwDMA_Stream_Index_5},
#endif
#if defined (UART4_BASE) || defined(USART4_BASE)
        {hwDMA_Stream_Index_6, hwDMA_Stream_Index_7},
#endif
#if defined (UART5_BASE) || defined(USART5_BASE)
        {hwDMA_Stream_Index_8, hwDMA_Stream_Index_9},
#endif
#if defined (UART6_BASE) || defined(USART6_BASE)
        {hwDMA_Stream_Index_10, hwDMA_Stream_Index_11},
#endif
};

static const hwDMA_Stream_Index SPI_DMA_Channel_Map[hwSPI_Index_MAX][hwDMA_Peripheral_Direction_MAX] = {
#if defined (SPI1_BASE)
        {hwDMA_Stream_Index_0, hwDMA_Stream_Index_1},
#endif
#if defined (SPI2_BASE)
        {hwDMA_Stream_Index_2, hwDMA_Stream_Index_3},
#endif
#if defined (SPI3_BASE)
        {hwDMA_Stream_Index_4, hwDMA_Stream_Index_5},
#endif
};

static const hwDMA_Stream_Index I2C_DMA_Channel_Map[hwI2C_Index_MAX][hwDMA_Peripheral_Direction_MAX] = {
#if defined (I2C1_BASE)
        {hwDMA_Stream_Index_0, hwDMA_Stream_Index_1},
#endif
#if defined (I2C2_BASE)
        {hwDMA_Stream_Index_2, hwDMA_Stream_Index_3},
#endif
#if defined (I2C3_BASE)
        {hwDMA_Stream_Index_4, hwDMA_Stream_Index_5},
#endif
};

DMA_TypeDef * DMA_Map_Soc_Base(hwDMA_Stream_Index index)
{
    switch(index)
    {
#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
        case hwDMA_Stream_Index_0:
#endif
#if defined (DMA1_Stream1)
        case hwDMA_Stream_Index_1:
#endif
#if defined (DMA1_Stream2)
        case hwDMA_Stream_Index_2:
#endif
#if defined (DMA1_Stream3)
        case hwDMA_Stream_Index_3:
#endif
#if defined (DMA1_Stream4)
        case hwDMA_Stream_Index_4:
#endif
#if defined (DMA1_Stream5)
        case hwDMA_Stream_Index_5:
#endif
#if defined (DMA1_Stream6)
        case hwDMA_Stream_Index_6:
#endif
#if defined (DMA1_Stream7)
        case hwDMA_Stream_Index_7:
#endif
                return DMA1;
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
        case hwDMA_Stream_Index_8:
#endif
#if defined (DMA2_Stream1)
        case hwDMA_Stream_Index_9:
#endif
#if defined (DMA2_Stream2)
        case hwDMA_Stream_Index_10:
#endif
#if defined (DMA2_Stream3)
        case hwDMA_Stream_Index_11:
#endif
#if defined (DMA2_Stream4)
        case hwDMA_Stream_Index_12:
#endif
#if defined (DMA2_Stream5)
        case hwDMA_Stream_Index_13:
#endif
#if defined (DMA2_Stream6)
        case hwDMA_Stream_Index_14:
#endif
#if defined (DMA2_Stream7)
        case hwDMA_Stream_Index_15:
#endif
                return DMA2;
#endif
        default:
                break;
    }
    return NULL;
}

DMA_Stream_TypeDef * DMA_Map_Soc_Stream_Base(hwDMA_Stream_Index index)
{
    switch(index)
    {
#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
        case hwDMA_Stream_Index_0: return DMA1_Stream0;
#endif
#if defined (DMA1_Stream1)
        case hwDMA_Stream_Index_1: return DMA1_Stream1;
#endif
#if defined (DMA1_Stream2)
        case hwDMA_Stream_Index_2: return DMA1_Stream2;
#endif
#if defined (DMA1_Stream3)
        case hwDMA_Stream_Index_3: return DMA1_Stream3;
#endif
#if defined (DMA1_Stream4)
        case hwDMA_Stream_Index_4: return DMA1_Stream4;
#endif
#if defined (DMA1_Stream5)
        case hwDMA_Stream_Index_5: return DMA1_Stream5;
#endif
#if defined (DMA1_Stream6)
        case hwDMA_Stream_Index_6: return DMA1_Stream6;
#endif
#if defined (DMA1_Stream7)
        case hwDMA_Stream_Index_7: return DMA1_Stream7;
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
        case hwDMA_Stream_Index_8: return DMA2_Stream0;
#endif
#if defined (DMA2_Stream1)
        case hwDMA_Stream_Index_9: return DMA2_Stream1;
#endif
#if defined (DMA2_Stream2)
        case hwDMA_Stream_Index_10: return DMA2_Stream2;
#endif
#if defined (DMA2_Stream3)
        case hwDMA_Stream_Index_11: return DMA2_Stream3;
#endif
#if defined (DMA2_Stream4)
        case hwDMA_Stream_Index_12: return DMA2_Stream4;
#endif
#if defined (DMA2_Stream5)
        case hwDMA_Stream_Index_13: return DMA2_Stream5;
#endif
#if defined (DMA2_Stream6)
        case hwDMA_Stream_Index_14: return DMA2_Stream6;
#endif
#if defined (DMA2_Stream7)
        case hwDMA_Stream_Index_15: return DMA2_Stream7;
#endif
#endif
        default: break;
    }
    return NULL;
}

static void DMA_IRQ_Handler(hwDMA_Stream_Index index)
{
        if(index>=hwDMA_Stream_Index_MAX)
        {
                return;
        }

        HAL_DMA_IRQHandler(&g_dma[index]);
}

#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
void DMA1_Stream0_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_0); }
#endif
#if defined (DMA1_Stream1)
void DMA1_Stream1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_1); }
#endif
#if defined (DMA1_Stream2)
void DMA1_Stream2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_2); }
#endif
#if defined (DMA1_Stream3)
void DMA1_Stream3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_3); }
#endif
#if defined (DMA1_Stream4)
void DMA1_Stream4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_4); }
#endif
#if defined (DMA1_Stream5)
void DMA1_Stream5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_5); }
#endif
#if defined (DMA1_Stream6)
void DMA1_Stream6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_6); }
#endif
#if defined (DMA1_Stream7)
void DMA1_Stream7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_7); }
#endif
#endif //DMA1_BASE

#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
void DMA2_Stream0_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_8); }
#endif
#if defined (DMA2_Stream1)
void DMA2_Stream1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_9); }
#endif
#if defined (DMA2_Stream2)
void DMA2_Stream2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_10); }
#endif
#if defined (DMA2_Stream3)
void DMA2_Stream3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_11); }
#endif
#if defined (DMA2_Stream4)
void DMA2_Stream4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_12); }
#endif
#if defined (DMA2_Stream5)
void DMA2_Stream5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_13); }
#endif
#if defined (DMA2_Stream6)
void DMA2_Stream6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_14); }
#endif
#if defined (DMA2_Stream7)
void DMA2_Stream7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_15); }
#endif
#endif //DMA2_BASE

void DMA_Clock_Enable()
{
#if defined (DMA1_BASE)
         __HAL_RCC_DMA1_CLK_ENABLE();
#endif //DMA1_BASE

#if defined (DMA2_BASE)
        __HAL_RCC_DMA2_CLK_ENABLE();
#endif //DMA2_BASE
}

