neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32F2.c
void DMA_Clock_Disable()
{
#if defined (DMA1_BASE)
        __HAL_RCC_DMA1_CLK_DISABLE();
#endif //DMA1_BASE

#if defined (DMA2_BASE)
        __HAL_RCC_DMA2_CLK_DISABLE();
#endif //DMA2_BASE
}

hwDMA_OpResult DMA_NVIC_Init(hwDMA_Stream_Index stream_index)
{
        if(stream_index>=hwDMA_Stream_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Stream_Init_Status[stream_index]==true)
        {
                return hwDMA_OK;
        }

        switch(stream_index)
        {
#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
                case hwDMA_Stream_Index_0:
                        HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
                        break;
#endif
#if defined (DMA1_Stream1)
                case hwDMA_Stream_Index_1:
                        HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);
                        break;
#endif
#if defined (DMA1_Stream2)
                case hwDMA_Stream_Index_2:
                        HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);
                        break;
#endif
#if defined (DMA1_Stream3)
                case hwDMA_Stream_Index_3:
                        HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
                        break;
#endif
#if defined (DMA1_Stream4)
                case hwDMA_Stream_Index_4:
                        HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);
                        break;
#endif
#if defined (DMA1_Stream5)
                case hwDMA_Stream_Index_5:
                        HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);
                        break;
#endif
#if defined (DMA1_Stream6)
                case hwDMA_Stream_Index_6:
                        HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);
                        break;
#endif
#if defined (DMA1_Stream7)
                case hwDMA_Stream_Index_7:
                        HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);
                        break;
#endif
#endif //DMA1_BASE
#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
                case hwDMA_Stream_Index_8:
                        HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);
                        break;
#endif
#if defined (DMA2_Stream1)
                case hwDMA_Stream_Index_9:
                        HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);
                        break;
#endif
#if defined (DMA2_Stream2)
                case hwDMA_Stream_Index_10:
                        HAL_NVIC_SetPriority(DMA2_Stream2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream2_IRQn);
                        break;
#endif
#if defined (DMA2_Stream3)
                case hwDMA_Stream_Index_11:
                        HAL_NVIC_SetPriority(DMA2_Stream3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);
                        break;
#endif
#if defined (DMA2_Stream4)
                case hwDMA_Stream_Index_12:
                        HAL_NVIC_SetPriority(DMA2_Stream4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream4_IRQn);
                        break;
#endif
#if defined (DMA2_Stream5)
                case hwDMA_Stream_Index_13:
                        HAL_NVIC_SetPriority(DMA2_Stream5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream5_IRQn);
                        break;
#endif
#if defined (DMA2_Stream6)
                case hwDMA_Stream_Index_14:
                        HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);
                        break;
#endif
#if defined (DMA2_Stream7)
                case hwDMA_Stream_Index_15:
                        HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);
                        break;
#endif
#endif //DMA2_BASE
        }

        DMA_Stream_Init_Status[stream_index] = true;

        return hwDMA_OK;
}

hwDMA_OpResult DMA_NVIC_DeInit(hwDMA_Stream_Index stream_index)
{
        if(stream_index>=hwDMA_Stream_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        switch(stream_index)
        {
#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
                case hwDMA_Stream_Index_0:
                        HAL_NVIC_DisableIRQ(DMA1_Stream0_IRQn);
                        break;
#endif
#if defined (DMA1_Stream1)
                case hwDMA_Stream_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Stream1_IRQn);
                        break;
#endif
#if defined (DMA1_Stream2)
                case hwDMA_Stream_Index_2:
                        HAL_NVIC_DisableIRQ(DMA1_Stream2_IRQn);
                        break;
#endif
#if defined (DMA1_Stream3)
                case hwDMA_Stream_Index_3:
                        HAL_NVIC_DisableIRQ(DMA1_Stream3_IRQn);
                        break;
#endif
#if defined (DMA1_Stream4)
                case hwDMA_Stream_Index_4:
                        HAL_NVIC_DisableIRQ(DMA1_Stream4_IRQn);
                        break;
#endif
#if defined (DMA1_Stream5)
                case hwDMA_Stream_Index_5:
                        HAL_NVIC_DisableIRQ(DMA1_Stream5_IRQn);
                        break;
#endif
#if defined (DMA1_Stream6)
                case hwDMA_Stream_Index_6:
                        HAL_NVIC_DisableIRQ(DMA1_Stream6_IRQn);
                        break;
#endif
#if defined (DMA1_Stream7)
                case hwDMA_Stream_Index_7:
                        HAL_NVIC_DisableIRQ(DMA1_Stream7_IRQn);
                        break;
#endif
#endif //DMA1_BASE
#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
                case hwDMA_Stream_Index_8:
                        HAL_NVIC_DisableIRQ(DMA2_Stream0_IRQn);
                        break;
#endif
#if defined (DMA2_Stream1)
                case hwDMA_Stream_Index_9:
                        HAL_NVIC_DisableIRQ(DMA2_Stream1_IRQn);
                        break;
#endif
#if defined (DMA2_Stream2)
                case hwDMA_Stream_Index_10:
                        HAL_NVIC_DisableIRQ(DMA2_Stream2_IRQn);
                        break;
#endif
#if defined (DMA2_Stream3)
                case hwDMA_Stream_Index_11:
                        HAL_NVIC_DisableIRQ(DMA2_Stream3_IRQn);
                        break;
#endif
#if defined (DMA2_Stream4)
                case hwDMA_Stream_Index_12:
                        HAL_NVIC_DisableIRQ(DMA2_Stream4_IRQn);
                        break;
#endif
#if defined (DMA2_Stream5)
                case hwDMA_Stream_Index_13:
                        HAL_NVIC_DisableIRQ(DMA2_Stream5_IRQn);
                        break;
#endif
#if defined (DMA2_Stream6)
                case hwDMA_Stream_Index_14:
                        HAL_NVIC_DisableIRQ(DMA2_Stream6_IRQn);
                        break;
#endif
#if defined (DMA2_Stream7)
                case hwDMA_Stream_Index_15:
                        HAL_NVIC_DisableIRQ(DMA2_Stream7_IRQn);
                        break;
#endif
#endif //DMA2_BASE
        }

